In [8]:
import pandas as pd
import numpy as np

In [9]:
from numpy.random import randn
np.random.seed(101)

### Creating a new column:

In [10]:
df3 = pd.DataFrame(randn(5,4), index = "A B C D E".split(), columns = "W X Y Z".split())
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df3["new"] = df3["W"] + df3["Y"]

In [12]:
df3

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [13]:
df3["new2"] = df3["X"] * df3["Z"]

In [14]:
df3

          W         X         Y         Z       new      new2
A  2.706850  0.628133  0.907969  0.503826  3.614819  0.316469
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.193496
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -0.435932
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542 -0.724766
E  0.190794  1.978757  2.605967  0.683509  2.796762  1.352498

### Removing Columns & RowsÂ¶

### Removing Columns

In [15]:
df3

          W         X         Y         Z       new      new2
A  2.706850  0.628133  0.907969  0.503826  3.614819  0.316469
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.193496
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -0.435932
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542 -0.724766
E  0.190794  1.978757  2.605967  0.683509  2.796762  1.352498

In [16]:
df3.drop(["new", "new2"], axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df3

          W         X         Y         Z       new      new2
A  2.706850  0.628133  0.907969  0.503826  3.614819  0.316469
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.193496
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -0.435932
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542 -0.724766
E  0.190794  1.978757  2.605967  0.683509  2.796762  1.352498

In [18]:
df3.drop(["new", "new2"], axis = 1, inplace = True)

In [19]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Drop Row

In [20]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df3.drop('E', axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [22]:
m = np.random.randint(1,30, size = (10,3))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df4

   var1  var2  var3
0     8    11    21
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13
5     1    21    11
6    13    18    25
7    12    20    16
8     2    25     5
9    29    20    19

### Selecting Rows

### loc ve iloc ile indexleme

In [23]:
df4.loc[1] # burdaki1 index no degil label adidir '1' loc label ile getirir.

var1    25
var2     8
var3     7
Name: 1, dtype: int32

In [24]:
df4.loc[1:4]

   var1  var2  var3
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13

In [25]:
df4.iloc[1:4] # index leme ile getiriyor !!!! iloc dikkat.

   var1  var2  var3
1    25     8     7
2    15    10    21
3    19    24     8

In [26]:
df4.iloc[[0]]

   var1  var2  var3
0     8    11    21

In [27]:
df4.iloc[[0]]

   var1  var2  var3
0     8    11    21

In [28]:
type(df4.iloc[[0]])

pandas.core.frame.DataFrame

In [29]:
df4.index= ['a','b','c','d','e','f','g','h','i','j']
df4

   var1  var2  var3
a     8    11    21
b    25     8     7
c    15    10    21
d    19    24     8
e     8    16    13
f     1    21    11
g    13    18    25
h    12    20    16
i     2    25     5
j    29    20    19

In [30]:
df4['b': 'd']   #string oldugunda index e son eleman da dahil olur numeric te oyle degil.

   var1  var2  var3
b    25     8     7
c    15    10    21
d    19    24     8

In [31]:
df4.iloc[1:4]

   var1  var2  var3
b    25     8     7
c    15    10    21
d    19    24     8

In [32]:
'var2' in df4

True

In [33]:
'joseph' in df4

False

In [34]:
df4.iloc[1,1]

8

In [35]:
df4

   var1  var2  var3
a     8    11    21
b    25     8     7
c    15    10    21
d    19    24     8
e     8    16    13
f     1    21    11
g    13    18    25
h    12    20    16
i     2    25     5
j    29    20    19

In [36]:
df4.loc['b': "e", 'var2']

b     8
c    10
d    24
e    16
Name: var2, dtype: int32

In [37]:
df4.loc['b': "e", ['var2']]

   var2
b     8
c    10
d    24
e    16

In [38]:
df4.iloc[1:5, 1]

b     8
c    10
d    24
e    16
Name: var2, dtype: int32

In [39]:
df4[1:5][['var2']]

   var2
b     8
c    10
d    24
e    16

In [40]:
from numpy.random import randn
np.random.seed(101)

In [41]:
df3 = pd.DataFrame(randn(5,4), index = "A B C D E".split(), columns = "W X Y Z".split())

In [42]:
#pd.DataFrame(randn(5,4), "A B C D E".split(), "W X Y Z".split())

In [43]:
#pd.DataFrame(index = "A B C D E".split(), data = randn(5,4), columns = "W X Y Z".split())

In [44]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Selection and IndexingÂ¶

In [45]:
df3['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [46]:
df3.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [49]:
type(df3['W'])

pandas.core.series.Series

In [52]:
df3.W.dtypes

dtype('float64')

In [53]:
type(df3.W)

pandas.core.series.Series